In [1]:

# importamos las librerías que necesitamos

# Tratamiento de datos
# -----------------------------------------------------------------------
import pandas as pd
import numpy as np

# Visualización
# ------------------------------------------------------------------------------
import matplotlib.pyplot as plt
import seaborn as sns

# Evaluar linealidad de las relaciones entre las variables
# y la distribución de las variables
# ------------------------------------------------------------------------------
import scipy.stats as stats
from scipy.stats import chi2_contingency, ttest_ind

# Imputación de nulos usando métodos avanzados estadísticos
# -----------------------------------------------------------------------
from sklearn.impute import SimpleImputer
from sklearn.experimental import enable_iterative_imputer
from sklearn.impute import IterativeImputer
from sklearn.impute import KNNImputer

# Configuración
# -----------------------------------------------------------------------
pd.set_option('display.max_columns', None) # para poder visualizar todas las columnas de los DataFrames

# Gestión de los warnings
# -----------------------------------------------------------------------
import warnings
warnings.filterwarnings("ignore")

In [2]:
# cargamos el dataframe correspondiente 
df = pd.read_csv("archivos/informacion_artista.csv")

display(df.head())

,artista_id,pais_de_origen,area_de_origen,fecha_nacimiento,fecha_inicio_actividad,fecha_fin_actividad
0,747,United States,New York,NaN,NaN,Actualidad
1,744,United States,Wasilla,NaN,2004.0,Actualidad
2,159,Sweden,Stockholm,NaN,NaN,Actualidad
3,426,Spain,Alcalá de Henares,1985-07-30,NaN,Actualidad
4,631,United States,San Francisco,NaN,2015.0,Actualidad

In [3]:
def exploracion(df):
    df_info = pd.DataFrame()
    df_info["% nulos"] = round(df.isna().sum()/df.shape[0]*100, 2).astype(str)+"%"
    df_info["% no_nulos"] = round(df.notna().sum()/df.shape[0]*100, 2).astype(str)+"%"
    df_info["tipo_dato"] = df.dtypes
    df_info["num_valores_unicos"] = df.nunique()
    print(f"""El DataFrame tiene {df.shape[0]} filas y {df.shape[1]} columnas.
Tiene {df.duplicated().sum()} datos duplicados, lo que supone un porcentaje de {round(df.duplicated().sum()/df.shape[0], 2)}% de los datos.
Hay {len(list(df_info[(df_info["% nulos"] != "0.0%")].index))} columnas con datos nulos, y son:
{list(df_info[(df_info["% nulos"] != "0.0%")].index)}
y sin nulos hay {len(list(df_info[(df_info["% nulos"] == "0.0%")].index))} columnas y son:
{list(df_info[(df_info["% nulos"] == "0.0%")].index)}
A continuación tienes un detalle sobre los datos nulos y los tipos y número de datos:""")
    display(df_info.head())
    print("Principales estadísticos de las columnas categóricas:")
    display(df.describe(include="O").T)
    print("Principales estadísticos de las columnas numéricas:")
    display(df.describe(exclude="O").T)
    return df_info

exploracion(df)

El DataFrame tiene 819 filas y 6 columnas.
Tiene 0 datos duplicados, lo que supone un porcentaje de 0.0% de los datos.
Hay 4 columnas con datos nulos, y son:
['pais_de_origen', 'area_de_origen', 'fecha_nacimiento', 'fecha_inicio_actividad']
y sin nulos hay 2 columnas y son:
['artista_id', 'fecha_fin_actividad']
A continuación tienes un detalle sobre los datos nulos y los tipos y número de datos:

                       % nulos % no_nulos tipo_dato  num_valores_unicos
artista_id                0.0%     100.0%     int64                 819
pais_de_origen           9.65%     90.35%    object                  35
area_de_origen          25.76%     74.24%    object                 369
fecha_nacimiento        58.73%     41.27%    object                 329
fecha_inicio_actividad  66.54%     33.46%   float64                  53

Principales estadísticos de las columnas categóricas:

                    count unique            top freq
pais_de_origen        740     35  United States  281
area_de_origen        608    369         Madrid   27
fecha_nacimiento      338    329     1996-01-01    3
fecha_fin_actividad   819     29     Actualidad  790

Principales estadísticos de las columnas numéricas:

,count,mean,std,min,25%,50%,75%,max
artista_id,819.0,452.223443,259.925827,1.0,226.5,457.0,674.5,899.0
fecha_inicio_actividad,274.0,2001.109489,11.725292,1958.0,1995.0,2002.5,2010.0,2021.0

                       % nulos % no_nulos tipo_dato  num_valores_unicos
artista_id                0.0%     100.0%     int64                 819
pais_de_origen           9.65%     90.35%    object                  35
area_de_origen          25.76%     74.24%    object                 369
fecha_nacimiento        58.73%     41.27%    object                 329
fecha_inicio_actividad  66.54%     33.46%   float64                  53
fecha_fin_actividad       0.0%     100.0%    object                  29

# Valores unicos de las variables categoricas ✨

In [4]:
# creamos una lista con los nombres de las columnas categoricas 
columnas = df.select_dtypes(include='object').columns.tolist()
print(columnas)
# empezamos a iterar por cada una de las columnas para sacar sus valores únicos y sus frecuencias
for columna in columnas:
    print(f" \n----------- ESTAMOS ANALIZANDO LA COLUMNA: '{columna.upper()}' -----------\n")
    print(f"Sus valores únicos son: {df[columna].unique()}\n")
    print(f"Las frecuencias de los valores únicos de las categorías son: {df[columna].value_counts()} ")

['pais_de_origen', 'area_de_origen', 'fecha_nacimiento', 'fecha_fin_actividad']

----------- ESTAMOS ANALIZANDO LA COLUMNA: 'PAIS_DE_ORIGEN' -----------

Sus valores únicos son: ['United States' 'Sweden' 'Spain' 'Mexico' 'Germany' 'United Kingdom'
 'Colombia' nan 'Ireland' 'Argentina' 'France' 'Japan' 'Australia'
 'Netherlands' 'Norway' 'Poland' 'Venezuela' 'Denmark' 'Iceland' 'Italy'
 'Chile' 'Cuba' 'Austria' 'Canada' 'Belgium' 'Greece' 'Costa Rica'
 'New Zealand' 'Brazil' 'Philippines' 'Panama' 'Dominican Republic'
 'Algeria' 'South Korea' 'Jamaica' 'Guatemala']

Las frecuencias de los valores únicos de las categorías son: pais_de_origen
United States         281
Spain                 185
United Kingdom         80
Argentina              24
Colombia               22
Canada                 17
Japan                  15
Germany                14
France                 10
Australia               9
Italy                   8
Venezuela               8
Sweden                  7
Mexico                  7
Poland                  6
Chile                   6
Iceland                 5
Denmark                 4
Dominican Republic      4
South Korea             3
Panama                  3
Ireland                 3
Brazil                  3
Belgium                 2
Netherlands             2
Cuba                    2
Austria                 2
Norway                  1
New Zealand             1
Greece                  1
Costa Rica              1
Philippines             1
Algeria                 1
Jamaica                 1
Guatemala               1
Name: count, dtype: int64

----------- ESTAMOS ANALIZANDO LA COLUMNA: 'AREA_DE_ORIGEN' -----------

Sus valores únicos son: ['New York' 'Wasilla' 'Stockholm' 'Alcalá de Henares' 'San Francisco'
 'Hermosillo' 'Berlin' nan 'North Carolina' 'Medellín' 'Río Piedras'
 'Montcada i Reixac' 'Putney' 'Paris' 'Doncaster' 'Columbus' 'Los Angeles'
 'Barcelona' 'Palma del Río' 'Oklahoma City' 'Comunidad Valenciana'
 'Philadelphia' 'Burgin' 'Santa Cruz de Tenerife' 'Corozal' 'Helsinki'
 'Bray' 'Madrid' 'Sacramento' 'Morón' 'Sevilla' 'San Juan' 'Zaragoza'
 'Argentina' 'Newark' 'London' 'Battle Creek' 'Glennville' 'Brooklyn'
 'Warner Robins' 'Woodland Hills' 'Boston' 'Estepona' 'Carolina'
 'San Diego' 'Asheville' 'Cataño' 'Burgos' 'Las Vegas' 'Buenos Aires'
 'Grenoble' 'Tokyo' 'Harlem' 'Versailles' 'Oxford' 'Lafayette' 'Nashville'
 'Leeds' 'Jefferson' 'Sydney' 'Soest' 'Getxo' 'Tromsø' 'Vitoria-Gasteiz'
 'Caracas' 'Warsaw' 'Gijón' 'Bogotá' 'Seattle' 'Gainesville' 'Leicester'
 'Collado Villalba' 'Essex' 'Nacka' 'Copenhagen' 'Antioquia' 'Milwaukee'
 'Monte Grande' 'Cartagena' 'Bonanza' 'Ferriday' 'Puerto Rico'
 'Des Moines' 'Sevenoaks' 'Atlanta' 'Greenville' 'Dixon' 'Oviedo' 'Cali'
 'Pinner' 'Troy' 'Reykjavík' 'Asturias' 'Spain' 'Baltimore' 'Osuna'
 'United States' 'Santiago' 'Úbeda' 'Rockville' 'Chicago' 'Manchester'
 'Bridgeport' 'Berriozar' 'Frankenmuth' 'Bergen County' 'Manhattan'
 'Córdoba' 'Fort Belvoir' 'Wien' 'Norwood' 'High Green' 'Cleveland'
 'Toronto' 'Guadalajara' 'Plano' 'Hamburg' 'Bayamón' 'Sint-Niklaas'
 'Torrejón de Ardoz' 'Perth' 'Bellingham' 'Berriz' 'Austin' 'Kalamazoo'
 'Dublin' 'Clanton' 'Liverpool' 'Jacksonville' 'Mazomanie' 'Greifswald'
 'Athens' 'Alcalá de Guadaíra' 'Arklow' 'Las Piedras' 'El Masnou'
 'Detroit' 'Murfreesboro' 'Pamplona' 'Yokohama' 'Kingston upon Thames'
 'Mobile' 'Naples' 'Canada' 'Zurich' 'Brighton' 'Cuernavaca' 'Sheffield'
 'Leesburg' 'Albacete' 'Huntington Beach' 'Bristol' 'Roma' 'Catalunya'
 'Bangor' 'Wrocław' 'Barranquilla' 'Dahlonega' 'Auckland' 'The Bronx'
 'Pereira' 'Vancouver' 'Texas' 'Alcázar de San Juan'
 'Sant Feliu de Llobregat' 'Toledo' 'United Kingdom' 'Dundas' 'Valdosta'
 'Rio de Janeiro' 'Florida' 'Pembury' 'Grayslake' 'Alessandria' 'Peckham'
 'Nottingham' 'Ibiza' 'Olongapo City' 'Louisville' 'Totnes'
 'Saint-Germain-en-Laye' 'Panama' 'Buffalo' 'Redcliffe' 'Leyton'
 'Kamloops' 'Rio Grande' 'Keller' 'Birmingham' 'Washington' 'Walton'
 'Rosario' 'Aston' 'Delray, Detroit' 'La Habana' 'New Albany' 'Watford'
 'Calabasas' 'Isla Vista' 'West Bromwich' 'Tullahoma' 'West Hollywood'
 'Tres Cantos' 'Cádiz' 'Kiel' 'Stanmore' 'Dijon' 'Ascoli Piceno' 'Palma'
 'Aylesbury' 'Badajoz' 'Cedartown' 'Romford' 'Keflavík' 'Vernon'
 'Santo Domingo' 'Gothenburg' 'Cambridge' 'San Sebastián' 'Greystones'
 'Fukuoka' 'Belfast' 'Málaga' 'Colón' 'Pittsburgh' 'Venezia' 'Mallorca'
 'Sant Climent de Llobregat' 'Pompano Beach' 'Bewdley' 'Sabadell'
 'Coatepec' 'Olympia' 'Havertown' 'Englewood' 'Poland' 'Downers Grove'
 'Bakersfield' 'Worthing' 'Minneapolis' 'Beaumont' 'Vila-real'
 'West Midlands' 'Inglewood' 'Hartlepool' 'Sumter' 'Montréal' 'Macon'
 'Amsterdam' 'Soto del Real' 'Fort Lauderdale' 'Wilmette' 'Ann Arbor'
 'Fairfax' 'Charleston' 'Caguas' 'Mérida' 'Valencia' 'Santa Barbara'
 'Santiago de los Caballeros' 'Punta Arenas' 'Oran' 'Croydon' 'Elche'
 'Tifton' 'Nyack' 'New Jersey' 'Mar del Plata' 'Figueres' 'Ravensdale'
 'Karlsruhe' 'Logroño' 'San Fernando' 'Fort Worth' 'Nagoya' 'Almería'
 'Glasgow' 'Massachusetts' 'Quilmes' 'Lanús' 'Le Plessis-Bouchard'
 'Milton' 'Vordingborg' 'Newfoundland and Labrador' 'Kassel' 'Aledo'
 'Ciego de Ávila' 'Ciudad de Panamá' 'Granada' 'Brixton' 'Burbank'
 'Clinton' 'Clearwater' 'Isle of Wight' 'Monaghan' 'Vacaville' 'Tupelo'
 'Yuba City' 'North Shields' 'Columbia' 'Germany' 'Flensburg'
 'South Korea' 'Point Pleasant' 'Torremolinos' 'Durham' 'Indianapolis'
 'Ferrol' 'Mexicali' 'Bilbao' 'California' 'Ellaville' 'Daytona Beach'
 'Valladolid' 'Linköping' 'Anne Arundel County' 'Leipzig' 'Glendale'
 'Windsor' 'Camprodon' 'Morehead' 'Duxbury' 'Akron' 'Palestine' 'Memphis'
 'Gyeongju' 'Hanna' 'Talavera de la Reina' 'Bastrop' 'Ricote' 'Formosa'
 'Abingdon-on-Thames' 'Melbourne' 'Basildon' 'Salinas' 'Irvine' 'A Coruña'
 'Aberdeen' 'Mosfellsbær' 'Eustis' 'Upper East Side' 'Miami'
 'Boulogne-Billancourt' 'Tarragona' 'Sakai' 'Haverhill' 'Kansas City'
 'Hollywood' 'Grand Saline' 'Venezuela' 'Kingston' 'Teignmouth'
 'Terre Haute' 'Ramsey' 'Envigado' 'Ottawa' 'Vilassar de Mar'
 'Colorado Springs' 'Hokes Bluff' 'Seneca' 'Derby' 'Newbury Park'
 'Lexington' 'Kobe' 'Mooloolaba' 'Talca' 'Vega Baja' 'Burlington'
 'Canarias' 'Cayey']

Las frecuencias de los valores únicos de las categorías son: area_de_origen
Madrid             27
London             24
Los Angeles        19
New York           12
Barcelona          11
                   ..
North Carolina      1
Mosfellsbær         1
Eustis              1
Upper East Side     1
Miami               1
Name: count, Length: 369, dtype: int64

----------- ESTAMOS ANALIZANDO LA COLUMNA: 'FECHA_NACIMIENTO' -----------

Sus valores únicos son: [nan '1985-07-30' '1965-02-16' '1984-11-09' '1986-01-01' '1994-01-14'
 '1994-01-15' '1977-09-01' '1940-01-14' '1997-08-05' '1995-09-12'
 '1995-01-02' '1986-11-06' '1983-12-13' '1994-03-14' '2000-10-04'
 '1980-03-03' '1990-03-17' '1982-03-15' '1977-02-07' '2006-10-25'
 '1993-01-10' '1980-12-29' '1998-01-01' '1993-11-15' '1986-04-07'
 '1963-11-04' '1987-05-19' '1984-07-25' '1983-06-30' '1992-12-01'
 '1980-02-25' '1997-02-25' '1992-07-14' '1984-04-05' '1986-09-19'
 '1988-10-28' '1981-03-24' '1985-01-27' '1991-03-19' '1973-07-15'
 '1965-09-11' '1978-01-12' '1978-07-21' '1976-03-30' '1985-01-20'
 '2003-09-26' '1986-06-29' '1978-01-07' '1985-05-18' '1980-04-28'
 '1977-01-14' '1993-01-01' '1965-02-23' '1991-09-08' '1985-11-10'
 '1985-12-22' '1975-04-07' '2000-01-27' '1980-04-24' '2001-08-03'
 '1979-01-21' '1935-09-29' '1994-06-26' '1980-08-18' '1990-10-07'
 '1996-03-11' '1985-05-20' '1990-01-05' '1991-05-20' '1947-03-25'
 '1994-03-10' '1972-11-23' '1949-02-12' '1981-05-03' '1952-12-16'
 '1990-03-29' '1976-10-08' '1985-10-13' '1986-06-27' '1983-09-10'
 '1982-09-20' '1992-04-01' '1985-01-01' '1991-05-02' '1977-04-28'
 '1988-08-17' '1994-02-13' '1985-12-23' '1986-03-07' '1986-11-02'
 '1972-12-25' '1994-06-19' '1992-11-26' '2002-03-25' '1986-02-23'
 '1985-04-05' '1988-10-02' '1969-09-01' '1973-07-05' '1981-10-15'
 '1998-04-08' '1978-09-30' '1975-07-01' '1992-03-13' '1991-10-19'
 '1844-03-10' '1979-08-15' '1979-12-27' '1995-12-30' '1982-03-20'
 '1997-05-27' '1993-06-01' '1993-06-08' '1976-07-17' '1994-09-28'
 '1986-06-12' '1968-01-27' '1993-10-09' '1893-04-16' '1992-01-01'
 '1988-08-23' '2003-01-01' '1981-07-21' '1994-10-28' '1991-12-11'
 '1992-10-30' '1992-10-18' '1986-09-30' '1978-01-01' '1990-03-30'
 '1981-01-29' '1993-12-05' '1984-03-31' '1979-08-28' '1972-02-07'
 '1905-02-06' '1980-01-01' '1970-12-24' '1973-01-01' '1992-08-19'
 '1989-01-01' '1983-05-11' '1957-11-29' '1989-09-24' '1981-09-24'
 '1991-09-09' '1971-12-21' '1993-04-09' '1989-05-11' '1989-08-17'
 '1942-06-18' '1988-07-02' '1468-07-12' '1995-07-25' '1989-06-21'
 '2000-08-25' '1948-12-03' '1989-04-02' '1985-05-07' '1974-10-01'
 '1990-08-25' '1948-08-20' '1962-10-01' '1985-05-14' '1970-06-04'
 '1977-01-01' '1955-11-30' '1976-05-18' '1976-03-17' '1993-10-18'
 '1990-11-17' '1996-10-03' '1984-12-08' '1975-06-20' '1978-11-10'
 '1998-11-08' '1975-07-19' '1971-11-29' '1990-06-20' '1986-12-16'
 '1980-05-19' '2000-04-12' '1980-11-14' '1993-12-03' '1957-01-01'
 '1999-06-27' '1987-05-07' '1997-06-11' '1983-10-07' '1964-09-28'
 '1984-02-26' '1989-05-31' '1993-02-03' '1996-01-01' '1993-10-25'
 '1994-12-16' '1995-08-22' '1882-12-09' '1977-04-25' '1979-08-01'
 '1989-04-03' '1991-02-14' '1983-04-19' '1984-09-17' '1852-11-21'
 '1978-12-04' '1979-02-19' '1997-03-02' '1998-04-05' '1996-07-02'
 '1979-06-10' '1974-09-18' '1977-02-28' '1994-01-28' '1979-02-17'
 '1993-06-20' '1985-06-30' '1989-07-03' '1964-10-22' '1995-03-21'
 '1989-08-09' '1992-09-16' '1999-04-14' '1986-12-10' '1997-08-27'
 '2000-02-04' '1960-02-29' '1985-01-21' '1980-04-01' '2000-04-13'
 '1998-04-12' '1974-05-23' '1981-06-01' '1985-01-08' '1962-03-18'
 '1979-06-05' '1981-11-13' '1978-02-10' '1971-04-24' '1951-11-14'
 '1968-01-20' '2000-02-12' '1975-02-22' '1986-06-18' '1986-01-20'
 '1972-10-16' '1974-11-10' '1986-03-23' '1976-05-01' '1999-08-10'
 '2001-02-07' '1997-07-25' '1983-01-01' '1949-11-08' '1981-02-26'
 '1977-02-19' '1935-01-08' '1986-02-24' '1984-03-11' '1994-04-25'
 '1980-01-17' '1972-01-01' '1942-11-15' '1981-01-15' '1965-11-21'
 '1969-03-11' '1952-08-20' '1975-06-25' '1983-04-16' '1984-06-27'
 '1972-11-06' '1986-08-01' '1977-06-12' '1956-08-18' '1998-08-25'
 '2001-04-24' '1988-01-01' '2001-11-11' '1860-05-29' '1996-12-15'
 '1990-12-18' '1977-07-26' '1974-03-08' '2002-06-19' '1985-10-12'
 '1983-06-03' '1990-10-22' '1991-10-26' '1944-02-14' '1987-11-03'
 '1980-03-01' '1984-05-04' '1977-02-03' '1987-12-01' '1994-11-21'
 '1987-10-05' '1994-10-15' '1992-02-24' '1977-02-24' '1988-04-29'
 '1986-03-28' '1978-12-13' '1964-05-30' '1995-08-04' '1980-06-20'
 '1965-01-12' '1994-11-14' '2004-03-20' '1972-05-04' '1994-04-14'
 '1990-04-12' '1999-10-09' '1986-12-12' '1958-07-26' '1997-03-07'
 '1992-09-19' '2000-05-29' '1983-10-03' '1968-10-07' '1982-12-23'
 '1990-04-30' '1979-11-27' '1992-11-27' '1997-10-11' '2001-12-19'
 '1995-08-13' '1964-06-07' '1999-10-04' '1978-12-19']

Las frecuencias de los valores únicos de las categorías son: fecha_nacimiento
1996-01-01    3
1979-01-21    2
1989-05-31    2
1998-01-01    2
1978-01-01    2
             ..
1979-08-15    1
1844-03-10    1
1991-10-19    1
1992-03-13    1
1976-07-17    1
Name: count, Length: 329, dtype: int64

----------- ESTAMOS ANALIZANDO LA COLUMNA: 'FECHA_FIN_ACTIVIDAD' -----------

Sus valores únicos son: ['Actualidad' '2021-11-03' '1996-01-01' '2023-06-01' '2024-08-10'
 '2017-10-02' '2022-10-28' '1973-01-01' '2022-10-29' '2015-12-28'
 '1968-01-01' '1908-09-28' '1991-11-24' '2014-11-01' '1987-06-30'
 '2009-01-01' '2005-01-01' '2001-01-01' '1980-09-22' '2003-01-01'
 '1529-01-01' '2011-02-02' '1949-01-14' '1909-12-15' '1977-08-16'
 '2006-05-10' '1909-05-18' '2022-02-06' '1994-04-05']

Las frecuencias de los valores únicos de las categorías son: fecha_fin_actividad
Actualidad    790
1996-01-01      2
2021-11-03      1
2023-06-01      1
2024-08-10      1
2017-10-02      1
2022-10-28      1
1973-01-01      1
2022-10-29      1
2015-12-28      1
1968-01-01      1
1908-09-28      1
1991-11-24      1
2014-11-01      1
1987-06-30      1
2009-01-01      1
2005-01-01      1
2001-01-01      1
1980-09-22      1
2003-01-01      1
1529-01-01      1
2011-02-02      1
1949-01-14      1
1909-12-15      1
1977-08-16      1
2006-05-10      1
1909-05-18      1
2022-02-06      1
1994-04-05      1
Name: count, dtype: int64

# DUPLICADOS

In [5]:
def get_duplicate_rows(df):
    """
    Encuentra y devuelve las filas completas duplicadas de un DataFrame.

    Args:
        df (pd.DataFrame): El DataFrame de entrada.

    Returns:
        pd.DataFrame: Un nuevo DataFrame con las filas duplicadas completas.
    """
    # Identificar duplicados basados en todas las columnas
    duplicate_rows = df[df.duplicated(keep=False)]
    return duplicate_rows

get_duplicate_rows(df)

Empty DataFrame
Columns: [artista_id, pais_de_origen, area_de_origen, fecha_nacimiento, fecha_inicio_actividad, fecha_fin_actividad]
Index: []

In [6]:
# index=False es útil si solo quieres los datos y no necesitas la columna de índice.
#df.to_csv("archivos/informacion_artista_MOD.csv", index=False)

In [7]:
# cargamos el dataframe correspondiente 
df = pd.read_csv("archivos/info_canciones.csv")

display(df.head())

,artista_id,nombre_cancion_album,tipo_album_cancion,año_lanzamiento,género
0,1,Seventeen,album,2022,Electrónica
1,2,Crust,album,2021,Electrónica
2,3,Abu Simbel,single,2021,Electrónica
3,4,Apricots,album,2021,Electrónica
4,5,KILL DEM,single,2022,Electrónica

In [8]:
exploracion(df)

El DataFrame tiene 4000 filas y 5 columnas.
Tiene 49 datos duplicados, lo que supone un porcentaje de 0.01% de los datos.
Hay 0 columnas con datos nulos, y son:
[]
y sin nulos hay 5 columnas y son:
['artista_id', 'nombre_cancion_album', 'tipo_album_cancion', 'año_lanzamiento', 'género']
A continuación tienes un detalle sobre los datos nulos y los tipos y número de datos:

                     % nulos % no_nulos tipo_dato  num_valores_unicos
artista_id              0.0%     100.0%     int64                 899
nombre_cancion_album    0.0%     100.0%    object                3563
tipo_album_cancion      0.0%     100.0%    object                   3
año_lanzamiento         0.0%     100.0%     int64                   2
género                  0.0%     100.0%    object                   4

Principales estadísticos de las columnas categóricas:

                     count unique          top  freq
nombre_cancion_album  4000   3563        Perra     4
tipo_album_cancion    4000      3        album  2508
género                4000      4  Electrónica  1000

Principales estadísticos de las columnas numéricas:

,count,mean,std,min,25%,50%,75%,max
artista_id,4000.0,323.220,239.358121,1.0,143.0,291.0,542.25,899.0
año_lanzamiento,4000.0,2021.544,0.498123,2021.0,2021.0,2022.0,2022.00,2022.0

                     % nulos % no_nulos tipo_dato  num_valores_unicos
artista_id              0.0%     100.0%     int64                 899
nombre_cancion_album    0.0%     100.0%    object                3563
tipo_album_cancion      0.0%     100.0%    object                   3
año_lanzamiento         0.0%     100.0%     int64                   2
género                  0.0%     100.0%    object                   4

In [9]:
# creamos una lista con los nombres de las columnas categoricas 
columnas = df.select_dtypes(include='object').columns.tolist()
print(columnas)
# empezamos a iterar por cada una de las columnas para sacar sus valores únicos y sus frecuencias
for columna in columnas:
    print(f" \n----------- ESTAMOS ANALIZANDO LA COLUMNA: '{columna.upper()}' -----------\n")
    print(f"Sus valores únicos son: {df[columna].unique()}\n")
    print(f"Las frecuencias de los valores únicos de las categorías son: {df[columna].value_counts()} ")

['nombre_cancion_album', 'tipo_album_cancion', 'género']

----------- ESTAMOS ANALIZANDO LA COLUMNA: 'NOMBRE_CANCION_ALBUM' -----------

Sus valores únicos son: ['Seventeen' 'Crust' 'Abu Simbel' ... 'Maybe You Saved Me' 'homeswitcher'
 'Summertime']

Las frecuencias de los valores únicos de las categorías son: nombre_cancion_album
Perra            4
Run              3
Nena             3
Nena Buena       3
Nosotros         3
                ..
LINDOR           1
Hp Freestyle     1
Nos Matamos      1
Más De La Una    1
Sicaria          1
Name: count, Length: 3563, dtype: int64

----------- ESTAMOS ANALIZANDO LA COLUMNA: 'TIPO_ALBUM_CANCION' -----------

Sus valores únicos son: ['album' 'single' 'compilation']

Las frecuencias de los valores únicos de las categorías son: tipo_album_cancion
album          2508
single         1446
compilation      46
Name: count, dtype: int64

----------- ESTAMOS ANALIZANDO LA COLUMNA: 'GÉNERO' -----------

Sus valores únicos son: ['Electrónica' 'Latino' 'Música Española' 'Rock']

Las frecuencias de los valores únicos de las categorías son: género
Electrónica        1000
Latino             1000
Música Española    1000
Rock               1000
Name: count, dtype: int64